<?php

use yii\db\Schema;
use yii\db\Migration;

class m141209_124406_countri extends Migration
{
    public function up()
    {

        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_unicode_ci ENGINE=InnoDB';
        }

        $this->createTable('{{%country}}', [
            'id' => Schema::TYPE_PK,
            'cid' => Schema::TYPE_INTEGER . '(11) NOT NULL',
            'lang_id' => Schema::TYPE_INTEGER . '(11) NOT NULL',
            'name' => Schema::TYPE_STRING . '(255) NOT NULL',
        ], $tableOptions);

        $this->createIndex('FK_country_lang_id', '{{%country}}', 'lang_id');
        $this->addForeignKey(
            'FK_country_lang_id', '{{%country}}', 'lang_id', '{{%lang}}', 'id', 'NO ACTION', 'CASCADE'
        );
        $this->batchInsert('{{%country}}', ['id', 'cid', 'lang_id', 'name'], [
            [1, 30, 1, 'Afghanistan'], [2, 21, 1, 'Albania'], [3, 22, 1, 'Algeria'], [4, 23, 1, 'American Samoa'],
            [5, 26, 1, 'Andorra'], [6, 25, 1, 'Angola'], [7, 24, 1, 'Anguilla'], [8, 27, 1, 'Antigua and Barbuda'],
            [9, 28, 1, 'Argentina'], [10, 6, 1, 'Armenia'], [11, 29, 1, 'Aruba'], [12, 19, 1, 'Australia'],
            [13, 20, 1, 'Austria'], [14, 5, 1, 'Azerbaijan'], [15, 31, 1, 'Bahamas'], [16, 34, 1, 'Bahrain'],
            [17, 32, 1, 'Bangladesh'], [18, 33, 1, 'Barbados'], [19, 3, 1, 'Belarus'], [20, 36, 1, 'Belgium'],
            [21, 35, 1, 'Belize'], [22, 37, 1, 'Benin'], [23, 38, 1, 'Bermuda'], [24, 47, 1, 'Bhutan'],
            [25, 40, 1, 'Bolivia'], [26, 235, 1, 'Bonaire, Sint Eustatius and Saba'], [27, 41, 1, 'Bosnia and Herzegovina'], [28, 42, 1, 'Botswana'],
            [29, 43, 1, 'Brazil'], [30, 52, 1, 'British Virgin Islands'], [31, 44, 1, 'Brunei Darussalam'], [32, 39, 1, 'Bulgaria'],
            [33, 45, 1, 'Burkina Faso'], [34, 46, 1, 'Burundi'], [35, 103, 1, 'Côte d`Ivoire'], [36, 91, 1, 'Cambodia'],
            [37, 92, 1, 'Cameroon'], [38, 10, 1, 'Canada'], [39, 90, 1, 'Cape Verde'], [40, 149, 1, 'Cayman Islands'],
            [41, 213, 1, 'Central African Republic'], [42, 214, 1, 'Chad'], [43, 216, 1, 'Chile'], [44, 97, 1, 'China'],
            [45, 98, 1, 'Colombia'], [46, 99, 1, 'Comoros'], [47, 100, 1, 'Congo'], [48, 101, 1, 'Congo, Democratic Republic'],
            [49, 150, 1, 'Cook Islands'], [50, 102, 1, 'Costa Rica'], [51, 212, 1, 'Croatia'], [52, 104, 1, 'Cuba'],
            [53, 138, 1, 'Curaçao'], [54, 95, 1, 'Cyprus'], [55, 215, 1, 'Czech Republic'], [56, 73, 1, 'Denmark'],
            [57, 231, 1, 'Djibouti'], [58, 74, 1, 'Dominica'], [59, 75, 1, 'Dominican Republic'], [60, 54, 1, 'East Timor'],
            [61, 221, 1, 'Ecuador'], [62, 76, 1, 'Egypt'], [63, 166, 1, 'El Salvador'], [64, 222, 1, 'Equatorial Guinea'],
            [65, 223, 1, 'Eritrea'], [66, 14, 1, 'Estonia'], [67, 224, 1, 'Ethiopia'], [68, 208, 1, 'Falkland Islands'],
            [69, 204, 1, 'Faroe Islands'], [70, 205, 1, 'Fiji'], [71, 207, 1, 'Finland'], [72, 209, 1, 'France'],
            [73, 210, 1, 'French Guiana'], [74, 211, 1, 'French Polynesia'], [75, 56, 1, 'Gabon'], [76, 59, 1, 'Gambia'],
            [77, 7, 1, 'Georgia'], [78, 65, 1, 'Germany'], [79, 60, 1, 'Ghana'], [80, 66, 1, 'Gibraltar'],
            [81, 71, 1, 'Greece'], [82, 70, 1, 'Greenland'], [83, 69, 1, 'Grenada'], [84, 61, 1, 'Guadeloupe'],
            [85, 72, 1, 'Guam'], [86, 62, 1, 'Guatemala'], [87, 63, 1, 'Guinea'], [88, 64, 1, 'Guinea-Bissau'],
            [89, 58, 1, 'Guyana'], [90, 57, 1, 'Haiti'], [91, 67, 1, 'Honduras'], [92, 68, 1, 'Hong Kong'],
            [93, 50, 1, 'Hungary'], [94, 86, 1, 'Iceland'], [95, 80, 1, 'India'], [96, 81, 1, 'Indonesia'],
            [97, 84, 1, 'Iran'], [98, 83, 1, 'Iraq'], [99, 85, 1, 'Ireland'], [100, 147, 1, 'Isle of Man'],
            [101, 8, 1, 'Israel'], [102, 88, 1, 'Italy'], [103, 228, 1, 'Jamaica'], [104, 229, 1, 'Japan'],
            [105, 82, 1, 'Jordan'], [106, 4, 1, 'Kazakhstan'], [107, 94, 1, 'Kenya'], [108, 96, 1, 'Kiribati'],
            [109, 105, 1, 'Kuwait'], [110, 11, 1, 'Kyrgyzstan'], [111, 106, 1, 'Laos'], [112, 12, 1, 'Latvia'],
            [113, 109, 1, 'Lebanon'], [114, 107, 1, 'Lesotho'], [115, 108, 1, 'Liberia'], [116, 110, 1, 'Libya'],
            [117, 111, 1, 'Liechtenstein'], [118, 13, 1, 'Lithuania'], [119, 112, 1, 'Luxembourg'], [120, 116, 1, 'Macau'],
            [121, 117, 1, 'Macedonia'], [122, 115, 1, 'Madagascar'], [123, 118, 1, 'Malawi'], [124, 119, 1, 'Malaysia'],
            [125, 121, 1, 'Maldives'], [126, 120, 1, 'Mali'], [127, 122, 1, 'Malta'], [128, 125, 1, 'Marshall Islands'],
            [129, 124, 1, 'Martinique'], [130, 114, 1, 'Mauritania'], [131, 113, 1, 'Mauritius'], [132, 126, 1, 'Mexico'],
            [133, 127, 1, 'Micronesia'], [134, 15, 1, 'Moldova'], [135, 129, 1, 'Monaco'], [136, 130, 1, 'Mongolia'],
            [137, 230, 1, 'Montenegro'], [138, 131, 1, 'Montserrat'], [139, 123, 1, 'Morocco'], [140, 128, 1, 'Mozambique'],
            [141, 132, 1, 'Myanmar'], [142, 133, 1, 'Namibia'], [143, 134, 1, 'Nauru'], [144, 135, 1, 'Nepal'],
            [145, 139, 1, 'Netherlands'], [146, 143, 1, 'New Caledonia'], [147, 142, 1, 'New Zealand'], [148, 140, 1, 'Nicaragua'],
            [149, 136, 1, 'Niger'], [150, 137, 1, 'Nigeria'], [151, 141, 1, 'Niue'], [152, 148, 1, 'Norfolk Island'],
            [153, 173, 1, 'North Korea'], [154, 174, 1, 'Northern Mariana Islands'], [155, 144, 1, 'Norway'], [156, 146, 1, 'Oman'],
            [157, 152, 1, 'Pakistan'], [158, 153, 1, 'Palau'], [159, 154, 1, 'Palestine'], [160, 155, 1, 'Panama'],
            [161, 156, 1, 'Papua New Guinea'], [162, 157, 1, 'Paraguay'], [163, 158, 1, 'Peru'], [164, 206, 1, 'Philippines'],
            [165, 159, 1, 'Pitcairn Islands'], [166, 160, 1, 'Poland'], [167, 161, 1, 'Portugal'], [168, 162, 1, 'Puerto Rico'],
            [169, 93, 1, 'Qatar'], [170, 163, 1, 'Réunion'], [171, 165, 1, 'Romania'], [172, 1, 1, 'Russia'],
            [173, 164, 1, 'Rwanda'], [174, 169, 1, 'São Tomé and Príncipe'], [175, 172, 1, 'Saint Helena'], [176, 178, 1, 'Saint Kitts and Nevis'],
            [177, 179, 1, 'Saint Lucia'], [178, 180, 1, 'Saint Pierre and Miquelon'], [179, 177, 1, 'Saint Vincent and the Grenadines'], [180, 167, 1, 'Samoa'],
            [181, 168, 1, 'San Marino'], [182, 170, 1, 'Saudi Arabia'], [183, 176, 1, 'Senegal'], [184, 181, 1, 'Serbia'],
            [185, 175, 1, 'Seychelles'], [186, 190, 1, 'Sierra Leone'], [187, 182, 1, 'Singapore'], [188, 234, 1, 'Sint Maarten'],
            [189, 184, 1, 'Slovakia'], [190, 185, 1, 'Slovenia'], [191, 186, 1, 'Solomon Islands'], [192, 187, 1, 'Somalia'],
            [193, 227, 1, 'South Africa'], [194, 226, 1, 'South Korea'], [195, 232, 1, 'South Sudan'], [196, 87, 1, 'Spain'],
            [197, 220, 1, 'Sri Lanka'], [198, 188, 1, 'Sudan'], [199, 189, 1, 'Suriname'], [200, 219, 1, 'Svalbard and Jan Mayen'],
            [201, 171, 1, 'Swaziland'], [202, 218, 1, 'Sweden'], [203, 217, 1, 'Switzerland'], [204, 183, 1, 'Syria'],
            [205, 192, 1, 'Taiwan'], [206, 16, 1, 'Tajikistan'], [207, 193, 1, 'Tanzania'], [208, 191, 1, 'Thailand'],
            [209, 194, 1, 'Togo'], [210, 195, 1, 'Tokelau'], [211, 196, 1, 'Tonga'], [212, 197, 1, 'Trinidad and Tobago'],
            [213, 199, 1, 'Tunisia'], [214, 200, 1, 'Turkey'], [215, 17, 1, 'Turkmenistan'], [216, 151, 1, 'Turks and Caicos Islands'],
            [217, 198, 1, 'Tuvalu'], [218, 53, 1, 'US Virgin Islands'], [219, 9, 1, 'USA'], [220, 201, 1, 'Uganda'],
            [221, 2, 1, 'Ukraine'], [222, 145, 1, 'United Arab Emirates'], [223, 49, 1, 'United Kingdom'], [224, 203, 1, 'Uruguay'],
            [225, 18, 1, 'Uzbekistan'], [226, 48, 1, 'Vanuatu'], [227, 233, 1, 'Vatican'], [228, 51, 1, 'Venezuela'],
            [229, 55, 1, 'Vietnam'], [230, 202, 1, 'Wallis and Futuna'], [231, 78, 1, 'Western Sahara'], [232, 89, 1, 'Yemen'],
            [233, 77, 1, 'Zambia'], [234, 79, 1, 'Zimbabwe'], [235, 19, 2, 'Австралия'], [236, 20, 2, 'Австрия'],
            [237, 5, 2, 'Азербайджан'], [238, 21, 2, 'Албания'], [239, 22, 2, 'Алжир'], [240, 23, 2, 'Американское Самоа'],
            [241, 24, 2, 'Ангилья'], [242, 25, 2, 'Ангола'], [243, 26, 2, 'Андорра'], [244, 27, 2, 'Антигуа и Барбуда'],
            [245, 28, 2, 'Аргентина'], [246, 6, 2, 'Армения'], [247, 29, 2, 'Аруба'], [248, 30, 2, 'Афганистан'],
            [249, 31, 2, 'Багамы'], [250, 32, 2, 'Бангладеш'], [251, 33, 2, 'Барбадос'], [252, 34, 2, 'Бахрейн'],
            [253, 3, 2, 'Беларусь'], [254, 35, 2, 'Белиз'], [255, 36, 2, 'Бельгия'], [256, 37, 2, 'Бенин'],
            [257, 38, 2, 'Бермуды'], [258, 39, 2, 'Болгария'], [259, 40, 2, 'Боливия'], [260, 235, 2, 'Бонайре, Синт-Эстатиус и Саба'],
            [261, 41, 2, 'Босния и Герцеговина'], [262, 42, 2, 'Ботсвана'], [263, 43, 2, 'Бразилия'], [264, 44, 2, 'Бруней-Даруссалам'],
            [265, 45, 2, 'Буркина-Фасо'], [266, 46, 2, 'Бурунди'], [267, 47, 2, 'Бутан'], [268, 48, 2, 'Вануату'],
            [269, 233, 2, 'Ватикан'], [270, 49, 2, 'Великобритания'], [271, 50, 2, 'Венгрия'], [272, 51, 2, 'Венесуэла'],
            [273, 52, 2, 'Виргинские острова, Британские'], [274, 53, 2, 'Виргинские острова, США'], [275, 54, 2, 'Восточный Тимор'], [276, 55, 2, 'Вьетнам'],
            [277, 56, 2, 'Габон'], [278, 57, 2, 'Гаити'], [279, 58, 2, 'Гайана'], [280, 59, 2, 'Гамбия'],
            [281, 60, 2, 'Гана'], [282, 61, 2, 'Гваделупа'], [283, 62, 2, 'Гватемала'], [284, 63, 2, 'Гвинея'],
            [285, 64, 2, 'Гвинея-Бисау'], [286, 65, 2, 'Германия'], [287, 66, 2, 'Гибралтар'], [288, 67, 2, 'Гондурас'],
            [289, 68, 2, 'Гонконг'], [290, 69, 2, 'Гренада'], [291, 70, 2, 'Гренландия'], [292, 71, 2, 'Греция'],
            [293, 7, 2, 'Грузия'], [294, 72, 2, 'Гуам'], [295, 73, 2, 'Дания'], [296, 231, 2, 'Джибути'],
            [297, 74, 2, 'Доминика'], [298, 75, 2, 'Доминиканская Республика'], [299, 76, 2, 'Египет'], [300, 77, 2, 'Замбия'],
            [301, 78, 2, 'Западная Сахара'], [302, 79, 2, 'Зимбабве'], [303, 8, 2, 'Израиль'], [304, 80, 2, 'Индия'],
            [305, 81, 2, 'Индонезия'], [306, 82, 2, 'Иордания'], [307, 83, 2, 'Ирак'], [308, 84, 2, 'Иран'],
            [309, 85, 2, 'Ирландия'], [310, 86, 2, 'Исландия'], [311, 87, 2, 'Испания'], [312, 88, 2, 'Италия'],
            [313, 89, 2, 'Йемен'], [314, 90, 2, 'Кабо-Верде'], [315, 4, 2, 'Казахстан'], [316, 91, 2, 'Камбоджа'],
            [317, 92, 2, 'Камерун'], [318, 10, 2, 'Канада'], [319, 93, 2, 'Катар'], [320, 94, 2, 'Кения'],
            [321, 95, 2, 'Кипр'], [322, 96, 2, 'Кирибати'], [323, 97, 2, 'Китай'], [324, 98, 2, 'Колумбия'],
            [325, 99, 2, 'Коморы'], [326, 100, 2, 'Конго'], [327, 101, 2, 'Конго, демократическая республика'], [328, 102, 2, 'Коста-Рика'],
            [329, 103, 2, 'Кот д`Ивуар'], [330, 104, 2, 'Куба'], [331, 105, 2, 'Кувейт'], [332, 11, 2, 'Кыргызстан'],
            [333, 138, 2, 'Кюрасао'], [334, 106, 2, 'Лаос'], [335, 12, 2, 'Латвия'], [336, 107, 2, 'Лесото'],
            [337, 108, 2, 'Либерия'], [338, 109, 2, 'Ливан'], [339, 110, 2, 'Ливия'], [340, 13, 2, 'Литва'],
            [341, 111, 2, 'Лихтенштейн'], [342, 112, 2, 'Люксембург'], [343, 113, 2, 'Маврикий'], [344, 114, 2, 'Мавритания'],
            [345, 115, 2, 'Мадагаскар'], [346, 116, 2, 'Макао'], [347, 117, 2, 'Македония'], [348, 118, 2, 'Малави'],
            [349, 119, 2, 'Малайзия'], [350, 120, 2, 'Мали'], [351, 121, 2, 'Мальдивы'], [352, 122, 2, 'Мальта'],
            [353, 123, 2, 'Марокко'], [354, 124, 2, 'Мартиника'], [355, 125, 2, 'Маршалловы Острова'], [356, 126, 2, 'Мексика'],
            [357, 127, 2, 'Микронезия, федеративные штаты'], [358, 128, 2, 'Мозамбик'], [359, 15, 2, 'Молдова'], [360, 129, 2, 'Монако'],
            [361, 130, 2, 'Монголия'], [362, 131, 2, 'Монтсеррат'], [363, 132, 2, 'Мьянма'], [364, 133, 2, 'Намибия'],
            [365, 134, 2, 'Науру'], [366, 135, 2, 'Непал'], [367, 136, 2, 'Нигер'], [368, 137, 2, 'Нигерия'],
            [369, 139, 2, 'Нидерланды'], [370, 140, 2, 'Никарагуа'], [371, 141, 2, 'Ниуэ'], [372, 142, 2, 'Новая Зеландия'],
            [373, 143, 2, 'Новая Каледония'], [374, 144, 2, 'Норвегия'], [375, 145, 2, 'Объединенные Арабские Эмираты'], [376, 146, 2, 'Оман'],
            [377, 147, 2, 'Остров Мэн'], [378, 148, 2, 'Остров Норфолк'], [379, 149, 2, 'Острова Кайман'], [380, 150, 2, 'Острова Кука'],
            [381, 151, 2, 'Острова Теркс и Кайкос'], [382, 152, 2, 'Пакистан'], [383, 153, 2, 'Палау'], [384, 154, 2, 'Палестинская автономия'],
            [385, 155, 2, 'Панама'], [386, 156, 2, 'Папуа - Новая Гвинея'], [387, 157, 2, 'Парагвай'], [388, 158, 2, 'Перу'],
            [389, 159, 2, 'Питкерн'], [390, 160, 2, 'Польша'], [391, 161, 2, 'Португалия'], [392, 162, 2, 'Пуэрто-Рико'],
            [393, 163, 2, 'Реюньон'], [394, 1, 2, 'Россия'], [395, 164, 2, 'Руанда'], [396, 165, 2, 'Румыния'],
            [397, 9, 2, 'США'], [398, 166, 2, 'Сальвадор'], [399, 167, 2, 'Самоа'], [400, 168, 2, 'Сан-Марино'],
            [401, 169, 2, 'Сан-Томе и Принсипи'], [402, 170, 2, 'Саудовская Аравия'], [403, 171, 2, 'Свазиленд'], [404, 172, 2, 'Святая Елена'],
            [405, 173, 2, 'Северная Корея'], [406, 174, 2, 'Северные Марианские острова'], [407, 175, 2, 'Сейшелы'], [408, 176, 2, 'Сенегал'],
            [409, 177, 2, 'Сент-Винсент'], [410, 178, 2, 'Сент-Китс и Невис'], [411, 179, 2, 'Сент-Люсия'], [412, 180, 2, 'Сент-Пьер и Микелон'],
            [413, 181, 2, 'Сербия'], [414, 182, 2, 'Сингапур'], [415, 234, 2, 'Синт-Мартен'], [416, 183, 2, 'Сирийская Арабская Республика'],
            [417, 184, 2, 'Словакия'], [418, 185, 2, 'Словения'], [419, 186, 2, 'Соломоновы Острова'], [420, 187, 2, 'Сомали'],
            [421, 188, 2, 'Судан'], [422, 189, 2, 'Суринам'], [423, 190, 2, 'Сьерра-Леоне'], [424, 16, 2, 'Таджикистан'],
            [425, 191, 2, 'Таиланд'], [426, 192, 2, 'Тайвань'], [427, 193, 2, 'Танзания'], [428, 194, 2, 'Того'],
            [429, 195, 2, 'Токелау'], [430, 196, 2, 'Тонга'], [431, 197, 2, 'Тринидад и Тобаго'], [432, 198, 2, 'Тувалу'],
            [433, 199, 2, 'Тунис'], [434, 17, 2, 'Туркменистан'], [435, 200, 2, 'Турция'], [436, 201, 2, 'Уганда'],
            [437, 18, 2, 'Узбекистан'], [438, 2, 2, 'Украина'], [439, 202, 2, 'Уоллис и Футуна'], [440, 203, 2, 'Уругвай'],
            [441, 204, 2, 'Фарерские острова'], [442, 205, 2, 'Фиджи'], [443, 206, 2, 'Филиппины'], [444, 207, 2, 'Финляндия'],
            [445, 208, 2, 'Фолклендские острова'], [446, 209, 2, 'Франция'], [447, 210, 2, 'Французская Гвиана'], [448, 211, 2, 'Французская Полинезия'],
            [449, 212, 2, 'Хорватия'], [450, 213, 2, 'Центрально-Африканская Республика'], [451, 214, 2, 'Чад'], [452, 230, 2, 'Черногория'],
            [453, 215, 2, 'Чехия'], [454, 216, 2, 'Чили'], [455, 217, 2, 'Швейцария'], [456, 218, 2, 'Швеция'],
            [457, 219, 2, 'Шпицберген и Ян Майен'], [458, 220, 2, 'Шри-Ланка'], [459, 221, 2, 'Эквадор'], [460, 222, 2, 'Экваториальная Гвинея'],
            [461, 223, 2, 'Эритрея'], [462, 14, 2, 'Эстония'], [463, 224, 2, 'Эфиопия'], [464, 226, 2, 'Южная Корея'],
            [465, 227, 2, 'Южно-Африканская Республика'], [466, 232, 2, 'Южный Судан'], [467, 228, 2, 'Ямайка'], [468, 229, 2, 'Япония'],
        ]);
    }

    public function down()
    {
       $this->dropTable('{{%country}}');

    }
}
